app/views/externaldraws/_form.html.erb

   <div class="field">
    <% for panel in Externalpanel.all %>
---
SELECT `externalpanels`.* FROM `externalpanels`