app/views/internalcolors/_form.html.erb

SELECT `internalpanels`.* FROM `internalpanels`
---
   <div class="field">
    <% for panel in Internalpanel.all %>