app/controllers/calculator_controller.rb

  def index
    @locks = Lock.all
    @jambs = Jamb.all
    @cylinders = Cylinder.all
    @findings = Finding.all
    @doplocks = Doplock.all
    @dopoptions = Dopoption.all

    @externalpanels = Externalpanel.all
    @internalpanels = Internalpanel.all
    @externaldraw = Externaldraw.joins(:externalpanel_externaldraws).where(:externalpanel_externaldraws => {:externalpanel_id => params[:id]})
    @externalcolor = Externalcolor.joins(:externalpanel_externalcolors).where(:externalpanel_externalcolors => {:externalpanel_id => params[:id]})

#для внутренних панелей
    @internalcolor = Internalcolor.joins(:internalpanel_internalcolors).where(:internalpanel_internalcolors => {:internalpanel_id => params[:internal_id]})
    @internaldraw = Internaldraw.joins(:internalpanel_internaldraws).where(:internalpanel_internaldraws => {:internalpanel_id => params[:internal_id]})
---
SELECT `locks`.* FROM `locks` WHERE (name like '%%')
SELECT `jambs`.* FROM `jambs`
SELECT `cylinders`.* FROM `cylinders`
SELECT `findings`.* FROM `findings`
SELECT `doplocks`.* FROM `doplocks`
SELECT `dopoptions`.* FROM `dopoptions`
SELECT `externalpanels`.* FROM `externalpanels`
SELECT `internalpanels`.* FROM `internalpanels`
SELECT `externaldraws`.* FROM `externaldraws` INNER JOIN `externalpanel_externaldraws` ON `externalpanel_externaldraws`.`externaldraw_id` = `externaldraws`.`id` INNER JOIN `externalpanel_externaldraws` `externalpanels_externaldraws_join` ON `externaldraws`.`id` = `externalpanels_externaldraws_join`.`externaldraw_id` INNER JOIN `externalpanels` ON `externalpanels`.`id` = `externalpanels_externaldraws_join`.`externalpanel_id` WHERE `externalpanel_externaldraws`.`externalpanel_id` = 1
SELECT `externalcolors`.* FROM `externalcolors` INNER JOIN `externalpanel_externalcolors` ON `externalpanel_externalcolors`.`externalcolor_id` = `externalcolors`.`id` WHERE `externalpanel_externalcolors`.`externalpanel_id` IS NULL
SELECT `internalcolors`.* FROM `internalcolors` INNER JOIN `internalpanel_internalcolors` ON `internalpanel_internalcolors`.`internalcolor_id` = `internalcolors`.`id` WHERE `internalpanel_internalcolors`.`internalpanel_id` IS NULL
SELECT `internaldraws`.* FROM `internaldraws` INNER JOIN `internalpanel_internaldraws` ON `internalpanel_internaldraws`.`internaldraw_id` = `internaldraws`.`id` WHERE `internalpanel_internaldraws`.`internalpanel_id` IS NULL

  def show
    @externaldraws = Externaldraw.joins(:externalpanel_externaldraws).where(:externalpanel_externaldraws => {:externalpanel_id => params[:id]})
    @locks = Lock.all
---
SELECT `externaldraws`.* FROM `externaldraws` INNER JOIN `externalpanel_externaldraws` ON `externalpanel_externaldraws`.`externaldraw_id` = `externaldraws`.`id` WHERE `externalpanel_externaldraws`.`externalpanel_id` = 1
SELECT `locks`.* FROM `locks`

  def new
    @locks = Lock.all
    @doplocks = Doplock.all
---
SELECT `locks`.* FROM `locks` WHERE (name like '%редут%')
SELECT `doplocks`.* FROM `doplocks`