app/controllers/cylinders_controller.rb

  def index
    @cylinders = Cylinder.all
---
SELECT `cylinders`.* FROM `cylinders`