app/controllers/doplocks_controller.rb

SELECT `doplocks`.* FROM `doplocks`
---
  def index
    @doplocks = Doplock.all

SELECT `doplocks`.* FROM `doplocks` WHERE `doplocks`.`id` = 1 LIMIT 1
---
  def show
    @doplock = Doplock.find(params[:id])

SELECT `doplocks`.* FROM `doplocks` WHERE `doplocks`.`id` = 1 LIMIT 1
---
  def edit
    @doplock = Doplock.find(params[:id])

INSERT INTO `doplocks` (`image_file_name`, `photo_updated_at`, `image_file_size`, `photo_file_size`, `photo_file_name`, `image_updated_at`, `updated_at`, `created_at`, `photo_content_type`, `cost`, `name`, `image_content_type`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, '2011-06-10 08:08:59', '2011-06-10 08:08:59', NULL, 'Доп замок 1', 'Доп замок 1', NULL)
---
  def create
    @doplock = Doplock.new(params[:doplock])

    respond_to do |format|
      if @doplock.save

SELECT `doplocks`.* FROM `doplocks` WHERE `doplocks`.`id` = 1 LIMIT 1
UPDATE `doplocks` SET `updated_at` = '2011-06-10 08:11:25', `cost` = '123123123' WHERE `doplocks`.`id` = 1
---
  def update
    @doplock = Doplock.find(params[:id])

    respond_to do |format|
      if @doplock.update_attributes(params[:doplock])