app/controllers/dopoptions_controller.rb

  def index
    @dopoptions = Dopoption.all
---
SELECT `dopoptions`.* FROM `dopoptions`

  def show
    @dopoption = Dopoption.find(params[:id])
---
SELECT `dopoptions`.* FROM `dopoptions` WHERE `dopoptions`.`id` = 1 LIMIT 1

  def edit
    @dopoption = Dopoption.find(params[:id])
---
SELECT `dopoptions`.* FROM `dopoptions` WHERE `dopoptions`.`id` = 1 LIMIT 1

  def create
    @dopoption = Dopoption.new(params[:dopoption])

    respond_to do |format|
      if @dopoption.save
---
INSERT INTO `dopoptions` (`photo_content_type`, `photo_updated_at`, `updated_at`, `photo_file_name`, `cost`, `created_at`, `name`, `photo_file_size`) VALUES (NULL, NULL, '2011-07-11 08:57:20', NULL, '2 000', '2011-07-11 08:57:20', 'Установка глазка', NULL)

  def update
    @dopoption = Dopoption.find(params[:id])

    respond_to do |format|
      if @dopoption.update_attributes(params[:dopoption])
---
SELECT `dopoptions`.* FROM `dopoptions` WHERE `dopoptions`.`id` = 1 LIMIT 1
UPDATE `dopoptions` SET `cost` = '12 000', `name` = 'Установка дверного проема', `updated_at` = '2011-07-11 08:56:34' WHERE `dopoptions`.`id` = 1