app/controllers/externalcolors_controller.rb

SELECT `externalcolors`.* FROM `externalcolors`
---
  def index
    @externalcolors = Externalcolor.all

SELECT `externalcolors`.* FROM `externalcolors` WHERE `externalcolors`.`id` = 1 LIMIT 1
---
  def show
    @externalcolor = Externalcolor.find(params[:id])

SELECT `externalcolors`.* FROM `externalcolors` WHERE `externalcolors`.`id` = 1 LIMIT 1
---
  def edit
    @externalcolor = Externalcolor.find(params[:id])

INSERT INTO `externalcolors` (`cost`, `photo_file_name`, `photo_updated_at`, `updated_at`, `photo_file_size`, `name`, `photo_content_type`, `created_at`, `image_updated_at`, `image_content_type`, `image_file_size`, `image_file_name`) VALUES ('1000', '1.jpg', '2011-07-09 22:03:03', '2011-07-09 22:03:03', 24131, 'цветовая гамма 2', 'image/jpeg', '2011-07-09 22:03:03', '2011-07-09 22:03:03', 'image/jpeg', 24131, '1.jpg')
---
  def create
    @externalcolor = Externalcolor.new(params[:externalcolor])

    respond_to do |format|
      if @externalcolor.save

SELECT `externalcolors`.* FROM `externalcolors` WHERE `externalcolors`.`id` = 1 LIMIT 1
---
  def update
    @externalcolor = Externalcolor.find(params[:id])

SELECT `externalcolors`.* FROM `externalcolors` WHERE `externalcolors`.`id` = 3 LIMIT 1
DELETE FROM `externalcolors` WHERE `externalcolors`.`id` = 3
---
  def destroy
    @externalcolor = Externalcolor.find(params[:id])
    @externalcolor.destroy