app/controllers/externalpanels_controller.rb

SELECT `externalpanels`.* FROM `externalpanels`
---
  def index
    @externalpanels = Externalpanel.all

SELECT `externalpanels`.* FROM `externalpanels` WHERE `externalpanels`.`id` = 2 LIMIT 1
---
  def show
    @externalpanel = Externalpanel.find(params[:id])

SELECT `externalpanels`.* FROM `externalpanels` WHERE `externalpanels`.`id` = 2 LIMIT 1
---
  def edit
    @externalpanel = Externalpanel.find(params[:id])

INSERT INTO `externalpanels` (`created_at`, `photo_updated_at`, `cost`, `image_file_size`, `name`, `image_content_type`, `image_updated_at`, `photo_content_type`, `image_file_name`, `updated_at`, `photo_file_size`, `photo_file_name`) VALUES ('2011-06-27 20:39:59', '2011-06-27 20:39:59', '10', 55544, 'Шпонированный или окрашенный МДФ толщиной 20 мм. и багетная рамка', 'image/jpeg', '2011-06-27 20:39:59', 'image/jpeg', 'panel2.jpg', '2011-06-27 20:39:59', 55544, 'panel2.jpg')
---
  def create
    @externalpanel = Externalpanel.new(params[:externalpanel])

    respond_to do |format|
      if @externalpanel.save

SELECT `externalpanels`.* FROM `externalpanels` WHERE `externalpanels`.`id` = 2 LIMIT 1
UPDATE `externalpanels` SET `photo_file_name` = 'omega_m.jpg', `image_file_size` = 12815, `photo_updated_at` = '2011-06-10 11:41:18', `photo_file_size` = 12815, `updated_at` = '2011-06-10 11:41:18', `image_updated_at` = '2011-06-10 11:41:18', `image_content_type` = 'image/jpeg', `image_file_name` = 'omega_m.jpg', `photo_content_type` = 'image/jpeg' WHERE `externalpanels`.`id` = 2
---
  def update
    @externalpanel = Externalpanel.find(params[:id])

    respond_to do |format|
      if @externalpanel.update_attributes(params[:externalpanel])

SELECT `externalpanels`.* FROM `externalpanels` WHERE `externalpanels`.`id` = 1 LIMIT 1
DELETE FROM `externalpanels` WHERE `externalpanels`.`id` = 1
---
  def destroy
    @externalpanel = Externalpanel.find(params[:id])
    @externalpanel.destroy