app/controllers/externaldraws_controller.rb

  def index
    @externaldraws = Externaldraw.all
---
SELECT `externaldraws`.* FROM `externaldraws`

  def show
    @externaldraw = Externaldraw.find(params[:id])
---
SELECT `externaldraws`.* FROM `externaldraws` WHERE `externaldraws`.`id` = 1 LIMIT 1

  def edit
    @externaldraw = Externaldraw.find(params[:id])
---
SELECT `externaldraws`.* FROM `externaldraws` WHERE `externaldraws`.`id` = 1 LIMIT 1

  def create
    @externaldraw = Externaldraw.new(params[:externaldraw])

    respond_to do |format|
      if @externaldraw.save
---
INSERT INTO `externaldraws` (`photo_updated_at`, `image_file_size`, `updated_at`, `photo_file_name`, `name`, `photo_content_type`, `created_at`, `image_file_name`, `image_updated_at`, `image_content_type`, `cost`, `photo_file_size`) VALUES ('2011-07-09 22:02:03', 22516, '2011-07-09 22:02:03', 'm1.jpg', 'Рисунок 2', 'image/jpeg', '2011-07-09 22:02:03', 'm1.jpg', '2011-07-09 22:02:03', 'image/jpeg', '1000', 22516)

  def update
    @externaldraw = Externaldraw.find(params[:id])

    respond_to do |format|
      if @externaldraw.update_attributes(params[:externaldraw])
---
SELECT `externaldraws`.* FROM `externaldraws` WHERE `externaldraws`.`id` = 1 LIMIT 1
UPDATE `externaldraws` SET `image_content_type` = 'image/jpeg', `image_file_size` = 7626, `photo_updated_at` = '2011-06-10 11:37:19', `photo_file_size` = 14888, `photo_content_type` = 'image/jpeg', `image_file_name` = 'fire_d.jpg', `image_updated_at` = '2011-06-10 11:37:19', `updated_at` = '2011-06-10 11:37:19', `photo_file_name` = 'citadel_d.jpg' WHERE `externaldraws`.`id` = 1

  def destroy
    @externaldraw = Externaldraw.find(params[:id])
    @externaldraw.destroy
---
SELECT `externaldraws`.* FROM `externaldraws` WHERE `externaldraws`.`id` = 2 LIMIT 1
DELETE FROM `externaldraws` WHERE `externaldraws`.`id` = 2