app/controllers/findings_controller.rb

  def index
    @findings = Finding.all
---
SELECT `findings`.* FROM `findings`

  def show
    @finding = Finding.find(params[:id])
---
SELECT `findings`.* FROM `findings` WHERE `findings`.`id` = 1 LIMIT 1

  def create
    @finding = Finding.new(params[:finding])

    respond_to do |format|
      if @finding.save
---
INSERT INTO `findings` (`image_content_type`, `created_at`, `image_file_name`, `name`, `image_updated_at`, `photo_updated_at`, `updated_at`, `photo_file_size`, `photo_content_type`, `photo_file_name`, `cost`, `image_file_size`) VALUES (NULL, '2011-06-10 07:54:51', NULL, 'Фурнитура 1', NULL, NULL, '2011-06-10 07:54:51', NULL, NULL, NULL, '123123', NULL)