app/controllers/internalpanels_controller.rb

SELECT `internalpanels`.* FROM `internalpanels`
---
  def index
    @internalpanels = Internalpanel.all

SELECT `internalpanels`.* FROM `internalpanels` WHERE `internalpanels`.`id` = 1 LIMIT 1
---
  def edit
    @internalpanel = Internalpanel.find(params[:id])