app/controllers/internalcolors_controller.rb

  def index
    @internalcolors = Internalcolor.all
---
SELECT `internalcolors`.* FROM `internalcolors`

  def show
    @internalcolor = Internalcolor.find(params[:id])
---
SELECT `internalcolors`.* FROM `internalcolors` WHERE `internalcolors`.`id` = 1 LIMIT 1

  def create
    @internalcolor = Internalcolor.new(params[:internalcolor])

    respond_to do |format|
      if @internalcolor.save
---
INSERT INTO `internalcolors` (`image_file_name`, `photo_updated_at`, `photo_file_size`, `updated_at`, `image_updated_at`, `photo_content_type`, `cost`, `image_content_type`, `created_at`, `photo_file_name`, `image_file_size`, `name`) VALUES ('1.jpg', '2011-06-28 14:56:57', 24131, '2011-06-28 14:56:57', '2011-06-28 14:56:57', 'image/jpeg', '123', 'image/jpeg', '2011-06-28 14:56:57', '1.jpg', 24131, 'Новый цвет для теста')