app/controllers/jambs_controller.rb

SELECT `jambs`.* FROM `jambs`
---
  def index
    @jambs = Jamb.all

SELECT `jambs`.* FROM `jambs` WHERE `jambs`.`id` = 1 LIMIT 1
---
  def edit
    @jamb = Jamb.find(params[:id])