app/controllers/locks_controller.rb

SELECT `locks`.* FROM `locks`
---
  def index
    @locks = Lock.all

SELECT `locks`.* FROM `locks` WHERE `locks`.`id` = 1 LIMIT 1
---
  def show
    @lock = Lock.find(params[:id])

SELECT `locks`.* FROM `locks` WHERE `locks`.`id` = 1 LIMIT 1
---
  def edit
    @lock = Lock.find(params[:id])

SELECT `locks`.* FROM `locks` WHERE `locks`.`id` = 1 LIMIT 1
UPDATE `locks` SET `name` = 'Взломостойкая двер MTL-405 РЕДУТ', `updated_at` = '2011-06-26 11:13:28' WHERE `locks`.`id` = 1
---
  def update
    @lock = Lock.find(params[:id])

    respond_to do |format|
      if @lock.update_attributes(params[:lock])